{
  "categories": [
    {
      "id": "ruou-vang-do",
      "name": "RƯỢU VANG ĐỎ",
      "slug": "ruou-vang-do",
      "count": 6
    },
    {
      "id": "ruou-trang",
      "name": "RƯỢU TRẮNG",
      "slug": "ruou-trang",
      "count": 3
    },
    {
      "id": "champagne",
      "name": "CHAMPAGNE",
      "slug": "champagne",
      "count": 2
    },
    {
      "id": "vang-phap",
      "name": "Vang Pháp",
      "slug": "vang-phap",
      "parentId": "ruou-vang-do",
      "count": 3
    },
    {
      "id": "vang-y",
      "name": "Vang Ý",
      "slug": "vang-y",
      "parentId": "ruou-vang-do",
      "count": 2
    },
    {
      "id": "vang-chile",
      "name": "Vang Chile",
      "slug": "vang-chile",
      "parentId": "ruou-vang-do",
      "count": 2
    },
    {
      "id": "vang-my",
      "name": "Vang Mỹ",
      "slug": "vang-my",
      "parentId": "ruou-vang-do",
      "count": 0
    },
    {
      "id": "vang-nam-phi",
      "name": "Vang Nam Phi",
      "slug": "vang-nam-phi",
      "parentId": "ruou-vang-do",
      "count": 0
    },
    {
      "id": "hang-doc",
      "name": "Hàng độc - Rượu độc đáo",
      "slug": "hang-doc",
      "parentId": "ruou-trang",
      "count": 2
    },
    {
      "id": "chivas",
      "name": "Rượu Chivas",
      "slug": "chivas",
      "parentId": "ruou-trang",
      "count": 0
    },
    {
      "id": "johnnie-walker",
      "name": "Johnnie Walker",
      "slug": "johnnie-walker",
      "parentId": "ruou-trang",
      "count": 1
    },
    {
      "id": "whisky",
      "name": "Rượu Whisky",
      "slug": "whisky",
      "parentId": "champagne",
      "count": 1
    },
    {
      "id": "remy-martin",
      "name": "Rượu Remy Martin",
      "slug": "remy-martin",
      "parentId": "champagne",
      "count": 1
    },
    {
      "id": "glenmorangie",
      "name": "Rượu Glenmorangie",
      "slug": "glenmorangie",
      "parentId": "champagne",
      "count": 0
    }
  ],
  "tags": [
    {
      "id": "tag1",
      "name": "tag1",
      "slug": "tag1",
      "count": 5
    },
    {
      "id": "alcohol",
      "name": "alcohol",
      "slug": "alcohol",
      "count": 12
    },
    {
      "id": "cheap",
      "name": "cheap",
      "slug": "cheap",
      "count": 8
    },
    {
      "id": "tag29",
      "name": "tag29",
      "slug": "tag29",
      "count": 3
    },
    {
      "id": "premium",
      "name": "premium",
      "slug": "premium",
      "count": 6
    }
  ],
  "products": [
    {
      "id": "1",
      "name": "Alcohol 1",
      "price": 57000,
      "oldPrice": 65000,
      "image": "/src/assets/products/1.jpg",
      "categoryId": "ruou-vang-do",
      "subcategoryId": "vang-phap",
      "description": "Description for Alcohol 1",
      "featured": false,
      "bestSelling": true,
      "new": false,
      "sale": true,
      "tags": ["tag1", "alcohol"],
      "features": "Đừng nghĩ rằng chỉ vì đôi chân to mà bạn không thể mặc được những đôi cao gót đẹp. Sau đây là những mẹo giúp bạn có thể tự tin đi giày cao gót.\n\nTrong những ngày hè, các chị em thường có xu hướng chọn cho mình những đôi giày cao gót có quai mảnh, nhưng điều này lại càng làm lộ đôi chân to của bạn. Thay vào đó, hãy chọn những đôi giày có quai to bản hoặc bít mũi, điều này sẽ giúp đôi chân bạn trông thon gọn hơn.",
      "information": "Rượu vang đỏ có nhiều loại, mỗi loại mang hương vị và đặc trưng riêng. Rượu vang đỏ được làm từ nho đỏ, được ủ và lên men theo quy trình nghiêm ngặt.\n\nSản phẩm này có nồng độ cồn vừa phải, hương vị đậm đà với notes của quả mọng đỏ, vani và chút hương gỗ sồi. Phù hợp để thưởng thức cùng các món thịt đỏ, phô mai hoặc đơn giản là nhâm nhi trong những buổi tối thư giãn.",
      "reviews": [
        {
          "id": 1,
          "name": "Nguyễn Văn A",
          "rating": 4,
          "date": "15/05/2023",
          "content": "Sản phẩm rất tuyệt vời, hương vị đậm đà và thơm ngon. Tôi rất hài lòng với sản phẩm này và sẽ tiếp tục mua trong tương lai."
        }
      ]
    },
    {
      "id": "2",
      "name": "Alcohol 10",
      "price": 30000,
      "oldPrice": 35200,
      "image": "/src/assets/products/2.jpg",
      "categoryId": "ruou-vang-do",
      "subcategoryId": "vang-phap",
      "description": "Description for Alcohol 10",
      "featured": false,
      "bestSelling": false,
      "new": true,
      "sale": true,
      "tags": ["alcohol", "cheap"],
      "features": "Rượu vang xanh là một loại rượu vang trắng đặc biệt với màu sắc hơi xanh lục nhẹ. Đây là loại rượu được sản xuất từ nho trắng với kỹ thuật đặc biệt giúp giữ lại một phần màu sắc tự nhiên từ vỏ nho.\n\nHương vị của rượu vang xanh thường tươi mát với notes của táo xanh, chanh và các loại trái cây nhiệt đới. Đây là loại rượu lý tưởng để thưởng thức trong những ngày hè nóng bức.",
      "information": "Rượu vang xanh được sản xuất chủ yếu ở các vùng ôn đới với khí hậu mát mẻ. Quy trình sản xuất đặc biệt giúp giữ lại hương vị tươi mát và màu sắc đặc trưng.\n\nSản phẩm này có nồng độ cồn trung bình, vị chua nhẹ và hậu vị kéo dài. Phù hợp để thưởng thức cùng các món hải sản, salad hoặc các món ăn nhẹ.",
      "reviews": [
        {
          "id": 1,
          "name": "Trần Thị B",
          "rating": 5,
          "date": "20/04/2023",
          "content": "Rượu vang xanh này có hương vị tuyệt vời, rất phù hợp với các món hải sản. Tôi đặc biệt thích vị chua nhẹ và hương thơm của nó."
        },
        {
          "id": 2,
          "name": "Lê Văn C",
          "rating": 4,
          "date": "05/05/2023",
          "content": "Sản phẩm chất lượng, đóng gói cẩn thận. Hương vị đúng như mô tả, rất tươi mát và dễ uống."
        }
      ]
    },
    {
      "id": "3",
      "name": "Alcohol 11",
      "price": 109000,
      "oldPrice": 95920,
      "image": "/src/assets/products/3.jpg",
      "categoryId": "ruou-vang-do",
      "subcategoryId": "vang-y",
      "description": "Description for Alcohol 11",
      "featured": false,
      "bestSelling": false,
      "new": false,
      "sale": true,
      "tags": ["alcohol", "premium"],
      "features": "Rượu vang vàng là loại rượu vang được làm từ nho trắng với quá trình lên men đặc biệt tạo ra màu vàng đặc trưng. Loại rượu này thường có hương vị phong phú và đậm đà hơn so với rượu vang trắng thông thường.\n\nĐặc điểm nổi bật của rượu vang vàng là hương thơm của mật ong, hoa cỏ và trái cây chín. Đây là loại rượu thích hợp để thưởng thức cùng các món ăn có vị đậm đà.",
      "information": "Rượu vang vàng được sản xuất bằng cách để vỏ nho tiếp xúc với nước nho trong thời gian ngắn, tạo ra màu vàng đặc trưng. Quá trình lên men thường diễn ra trong thùng gỗ sồi để tạo thêm hương vị.\n\nSản phẩm này có nồng độ cồn trung bình đến cao, vị ngọt nhẹ và hậu vị kéo dài. Phù hợp để thưởng thức cùng các món thịt trắng, hải sản hoặc các món ăn có nước sốt kem.",
      "reviews": [
        {
          "id": 1,
          "name": "Phạm Thị D",
          "rating": 5,
          "date": "10/03/2023",
          "content": "Rượu vang vàng này có hương vị tuyệt vời, rất phù hợp với các món thịt trắng. Tôi đặc biệt thích hương thơm của mật ong và hoa cỏ."
        }
      ]
    },
    {
      "id": "4",
      "name": "Alcohol 22",
      "price": 19000,
      "oldPrice": 18620,
      "image": "/src/assets/products/4.jpg",
      "categoryId": "ruou-trang",
      "subcategoryId": "hang-doc",
      "description": "Description for Alcohol 22",
      "featured": false,
      "bestSelling": false,
      "new": true,
      "sale": true,
      "tags": ["tag29", "cheap"],
      "features": "Rượu vang trắng là loại rượu vang được làm từ nho trắng hoặc nho đỏ nhưng không để vỏ nho tiếp xúc với nước nho trong quá trình lên men. Đây là loại rượu có màu sắc từ trong suốt đến vàng nhạt.\n\nĐặc điểm nổi bật của rượu vang trắng là hương thơm của trái cây như táo, lê, đào và các loại hoa. Đây là loại rượu thích hợp để thưởng thức trong những ngày nóng hoặc khi ăn các món nhẹ.",
      "information": "Rượu vang trắng được sản xuất bằng cách ép nho và lên men nước nho mà không có vỏ. Quá trình lên men thường diễn ra ở nhiệt độ thấp để giữ hương vị tươi mát.\n\nSản phẩm này có nồng độ cồn thấp đến trung bình, vị chua nhẹ và hậu vị tươi mát. Phù hợp để thưởng thức cùng các món hải sản, salad hoặc các món ăn nhẹ.",
      "reviews": [
        {
          "id": 1,
          "name": "Hoàng Văn E",
          "rating": 4,
          "date": "25/02/2023",
          "content": "Rượu vang trắng này có hương vị tươi mát, rất phù hợp với các món hải sản. Tôi đặc biệt thích vị chua nhẹ và hương thơm của trái cây."
        },
        {
          "id": 2,
          "name": "Nguyễn Thị F",
          "rating": 3,
          "date": "15/03/2023",
          "content": "Sản phẩm chất lượng khá tốt, hương vị tươi mát nhưng hơi nhạt so với mong đợi. Đóng gói cẩn thận và giao hàng nhanh chóng."
        }
      ]
    },
    {
      "id": "5",
      "name": "Alcohol 29",
      "price": 147000,
      "image": "/src/assets/products/5.jpg",
      "categoryId": "ruou-trang",
      "subcategoryId": "hang-doc",
      "description": "Description for Alcohol 29",
      "countdown": {
        "days": 334,
        "hours": 26,
        "minutes": 60,
        "seconds": 15
      },
      "featured": true,
      "bestSelling": false,
      "new": false,
      "sale": false,
      "tags": ["tag29", "premium"],
      "features": "Rượu nho năm 1987 là một loại rượu vang vintage đặc biệt, được sản xuất từ nho thu hoạch trong năm 1987 - một năm được đánh giá là có điều kiện thời tiết lý tưởng cho việc trồng nho.\n\nĐặc điểm nổi bật của rượu vang vintage này là hương vị phức tạp đã phát triển qua thời gian, với notes của trái cây khô, da thuộc, và các loại gia vị. Đây là loại rượu thích hợp để thưởng thức trong các dịp đặc biệt.",
      "information": "Rượu nho năm 1987 được sản xuất theo phương pháp truyền thống và được ủ trong thùng gỗ sồi trong nhiều năm trước khi đóng chai. Sau đó, rượu tiếp tục được lưu trữ trong điều kiện lý tưởng để phát triển hương vị.\n\nSản phẩm này có nồng độ cồn cao, vị đậm đà và hậu vị kéo dài. Phù hợp để thưởng thức cùng các món thịt đỏ, phô mai lâu năm hoặc đơn giản là thưởng thức một mình để cảm nhận đầy đủ hương vị.",
      "reviews": [
        {
          "id": 1,
          "name": "Trần Văn G",
          "rating": 5,
          "date": "05/01/2023",
          "content": "Rượu nho năm 1987 này là một trong những loại rượu vang ngon nhất mà tôi từng thưởng thức. Hương vị phức tạp và đậm đà, thực sự xứng đáng với giá tiền."
        },
        {
          "id": 2,
          "name": "Lê Thị H",
          "rating": 5,
          "date": "20/01/2023",
          "content": "Tôi mua chai rượu này để tặng cho bố tôi nhân dịp sinh nhật và ông rất thích. Hương vị đặc biệt và đóng gói rất sang trọng."
        }
      ]
    },
    {
      "id": "6",
      "name": "RƯỢU VANG ITALIA",
      "price": 320000,
      "image": "/src/assets/products/6.jpg",
      "categoryId": "ruou-vang-do",
      "subcategoryId": "vang-y",
      "description": "Mauris dolor ut hendrerit ut vulputate velit esse molestie consequat, vel illum dolore eu feugiat nulla facilisis at vero eros et accumsan et iusto odio dignissim qui blandit praesent luptatum zzril delenit augue duis dolore.",
      "featured": false,
      "bestSelling": true,
      "new": true,
      "sale": false,
      "tags": ["alcohol", "premium"],
      "features": "Rượu vang Italia là loại rượu vang được sản xuất tại Italia - một trong những quốc gia có truyền thống lâu đời về sản xuất rượu vang. Đây là loại rượu có hương vị đặc trưng của vùng đất Italia.\n\nĐặc điểm nổi bật của rượu vang Italia là hương thơm của các loại trái cây như cherry, mận, và các loại gia vị. Đây là loại rượu thích hợp để thưởng thức cùng các món ăn Italia truyền thống.",
      "information": "Rượu vang Italia được sản xuất từ các giống nho đặc trưng của Italia như Sangiovese, Nebbiolo, và Barbera. Quá trình sản xuất tuân theo các quy định nghiêm ngặt của Italia về rượu vang.\n\nSản phẩm này có nồng độ cồn trung bình, vị cân bằng giữa chua và chát, với hậu vị kéo dài. Phù hợp để thưởng thức cùng các món pasta, pizza, hoặc các món thịt đỏ.",
      "reviews": [
        {
          "id": 1,
          "name": "Phạm Văn I",
          "rating": 4,
          "date": "15/12/2022",
          "content": "Rượu vang Italia này có hương vị đặc trưng của vùng đất Italia, rất phù hợp với các món ăn Italia. Tôi đặc biệt thích hương thơm của cherry và mận."
        }
      ]
    },
    {
      "id": "7",
      "name": "RƯỢU VANG LẠT",
      "price": 320000,
      "oldPrice": 370000,
      "image": "/src/assets/products/7.jpg",
      "categoryId": "ruou-vang-do",
      "subcategoryId": "vang-chile",
      "description": "Mauris dolor ut hendrerit ut vulputate velit esse molestie consequat, vel illum dolore eu feugiat nulla facilisis at vero eros et accumsan et iusto odio dignissim qui blandit praesent luptatum zzril delenit augue duis dolore.",
      "featured": false,
      "bestSelling": true,
      "new": false,
      "sale": false,
      "tags": ["alcohol"],
      "features": "Rượu vang Lạt là loại rượu vang được sản xuất tại Đà Lạt, Việt Nam - một vùng đất có khí hậu ôn đới thích hợp cho việc trồng nho. Đây là loại rượu có hương vị đặc trưng của vùng đất Đà Lạt.\n\nĐặc điểm nổi bật của rượu vang Lạt là hương thơm của các loại trái cây như dâu tây, việt quất, và các loại hoa. Đây là loại rượu thích hợp để thưởng thức cùng các món ăn Việt Nam.",
      "information": "Rượu vang Lạt được sản xuất từ các giống nho được trồng tại Đà Lạt, Việt Nam. Quá trình sản xuất kết hợp giữa kỹ thuật truyền thống và công nghệ hiện đại.\n\nSản phẩm này có nồng độ cồn thấp đến trung bình, vị ngọt nhẹ và hậu vị tươi mát. Phù hợp để thưởng thức cùng các món ăn Việt Nam hoặc các món ăn có vị chua ngọt.",
      "reviews": [
        {
          "id": 1,
          "name": "Hoàng Thị K",
          "rating": 5,
          "date": "10/11/2022",
          "content": "Rượu vang Lạt này có hương vị đặc trưng của vùng đất Đà Lạt, rất phù hợp với các món ăn Việt Nam. Tôi đặc biệt thích hương thơm của dâu tây và việt quất."
        },
        {
          "id": 2,
          "name": "Nguyễn Văn L",
          "rating": 4,
          "date": "25/11/2022",
          "content": "Sản phẩm chất lượng tốt, hương vị đặc trưng của vùng đất Đà Lạt. Đóng gói cẩn thận và giao hàng nhanh chóng."
        }
      ]
    },
    {
      "id": "8",
      "name": "RƯỢU VANG RAU",
      "price": 320000,
      "image": "/src/assets/products/8.jpg",
      "categoryId": "ruou-vang-do",
      "subcategoryId": "vang-chile",
      "description": "Mauris dolor ut hendrerit ut vulputate velit esse molestie consequat, vel illum dolore eu feugiat nulla facilisis at vero eros et accumsan et iusto odio dignissim qui blandit praesent luptatum zzril delenit augue duis dolore.",
      "featured": false,
      "bestSelling": true,
      "new": false,
      "sale": false,
      "tags": ["alcohol"],
      "features": "Rượu vang Rau là một loại rượu vang đặc biệt được làm từ nho và một số loại rau thơm. Đây là loại rượu có hương vị độc đáo và khác biệt so với các loại rượu vang thông thường.\n\nĐặc điểm nổi bật của rượu vang Rau là hương thơm của các loại rau thơm như húng quế, rosemary, và thyme. Đây là loại rượu thích hợp để thưởng thức cùng các món ăn có nhiều rau và gia vị.",
      "information": "Rượu vang Rau được sản xuất bằng cách ngâm các loại rau thơm trong rượu vang trong một thời gian nhất định. Quá trình này giúp rượu vang hấp thụ hương vị và dưỡng chất từ các loại rau.\n\nSản phẩm này có nồng độ cồn trung bình, vị đậm đà với notes của rau thơm và hậu vị kéo dài. Phù hợp để thưởng thức cùng các món salad, các món ăn có nhiều rau hoặc các món ăn có vị chua.",
      "reviews": [
        {
          "id": 1,
          "name": "Trần Thị M",
          "rating": 4,
          "date": "05/10/2022",
          "content": "Rượu vang Rau này có hương vị độc đáo và khác biệt, rất phù hợp với các món salad. Tôi đặc biệt thích hương thơm của húng quế và rosemary."
        }
      ]
    },
    {
      "id": "9",
      "name": "RƯỢU VANG TRẮNG XANH",
      "price": 320000,
      "oldPrice": 370000,
      "image": "/src/assets/products/9.jpg",
      "categoryId": "ruou-trang",
      "subcategoryId": "johnnie-walker",
      "description": "Mauris dolor ut hendrerit ut vulputate velit esse molestie consequat, vel illum dolore eu feugiat nulla facilisis at vero eros et accumsan et iusto odio dignissim qui blandit praesent luptatum zzril delenit augue duis dolore.",
      "featured": false,
      "bestSelling": false,
      "new": true,
      "sale": false,
      "tags": ["alcohol", "premium"],
      "features": "Rượu vang Trắng Xanh là một loại rượu vang trắng đặc biệt với màu sắc hơi xanh lục nhẹ. Đây là loại rượu được sản xuất từ nho trắng với kỹ thuật đặc biệt giúp giữ lại một phần màu sắc tự nhiên từ vỏ nho.\n\nĐặc điểm nổi bật của rượu vang Trắng Xanh là hương thơm của táo xanh, chanh và các loại trái cây nhiệt đới. Đây là loại rượu lý tưởng để thưởng thức trong những ngày hè nóng bức.",
      "information": "Rượu vang Trắng Xanh được sản xuất chủ yếu ở các vùng ôn đới với khí hậu mát mẻ. Quy trình sản xuất đặc biệt giúp giữ lại hương vị tươi mát và màu sắc đặc trưng.\n\nSản phẩm này có nồng độ cồn trung bình, vị chua nhẹ và hậu vị kéo dài. Phù hợp để thưởng thức cùng các món hải sản, salad hoặc các món ăn nhẹ.",
      "reviews": [
        {
          "id": 1,
          "name": "Lê Văn N",
          "rating": 5,
          "date": "20/09/2022",
          "content": "Rượu vang Trắng Xanh này có hương vị tuyệt vời, rất phù hợp với các món hải sản. Tôi đặc biệt thích vị chua nhẹ và hương thơm của táo xanh và chanh."
        },
        {
          "id": 2,
          "name": "Phạm Thị O",
          "rating": 4,
          "date": "05/10/2022",
          "content": "Sản phẩm chất lượng tốt, hương vị tươi mát và dễ uống. Đóng gói cẩn thận và giao hàng nhanh chóng."
        }
      ]
    },
    {
      "id": "10",
      "name": "CHAMPAGNE CLASSIC",
      "price": 450000,
      "image": "/src/assets/products/10.jpg",
      "categoryId": "champagne",
      "subcategoryId": "whisky",
      "description": "Champagne cao cấp với hương vị tinh tế và bọt ga mịn màng. Sản phẩm lý tưởng cho các dịp lễ kỷ niệm và tiệc tùng sang trọng.",
      "featured": false,
      "bestSelling": false,
      "new": true,
      "sale": true,
      "tags": ["alcohol", "premium"],
      "features": "Champagne Classic là một loại rượu vang sủi bọt cao cấp được sản xuất tại vùng Champagne, Pháp. Đây là loại rượu có hương vị tinh tế và bọt ga mịn màng.\n\nĐặc điểm nổi bật của Champagne Classic là hương thơm của táo, lê, và bánh mì nướng. Đây là loại rượu lý tưởng cho các dịp lễ kỷ niệm và tiệc tùng sang trọng.",
      "information": "Champagne Classic được sản xuất theo phương pháp truyền thống của vùng Champagne, Pháp. Quá trình sản xuất bao gồm việc lên men lần thứ hai trong chai để tạo ra bọt ga tự nhiên.\n\nSản phẩm này có nồng độ cồn trung bình, vị cân bằng giữa chua và ngọt, với bọt ga mịn màng và hậu vị kéo dài. Phù hợp để thưởng thức như một loại aperitif hoặc cùng với các món tráng miệng.",
      "reviews": [
        {
          "id": 1,
          "name": "Hoàng Văn P",
          "rating": 5,
          "date": "15/08/2022",
          "content": "Champagne Classic này có hương vị tinh tế và bọt ga mịn màng, rất phù hợp cho các dịp đặc biệt. Tôi đặc biệt thích hương thơm của táo, lê, và bánh mì nướng."
        }
      ]
    },
    {
      "id": "11",
      "name": "CHAMPAGNE PREMIUM",
      "price": 520000,
      "image": "/src/assets/products/11.jpg",
      "categoryId": "champagne",
      "subcategoryId": "remy-martin",
      "description": "Champagne premium với hương thơm của hoa quả và bánh mì nướng. Vị ngọt nhẹ và độ chua cân bằng tạo nên trải nghiệm thưởng thức tuyệt vời.",
      "featured": false,
      "bestSelling": false,
      "new": false,
      "sale": true,
      "tags": ["alcohol", "premium"],
      "features": "Champagne Premium là một loại rượu vang sủi bọt cao cấp được sản xuất tại vùng Champagne, Pháp. Đây là loại rượu có hương vị phong phú và bọt ga mịn màng.\n\nĐặc điểm nổi bật của Champagne Premium là hương thơm của hoa quả chín, bánh mì nướng, và hạt dẻ. Đây là loại rượu lý tưởng cho các dịp đặc biệt và tiệc tùng sang trọng.",
      "information": "Champagne Premium được sản xuất theo phương pháp truyền thống của vùng Champagne, Pháp, với sự lựa chọn kỹ lưỡng về nho và thời gian ủ lâu hơn. Quá trình sản xuất bao gồm việc lên men lần thứ hai trong chai để tạo ra bọt ga tự nhiên.\n\nSản phẩm này có nồng độ cồn trung bình đến cao, vị cân bằng giữa chua và ngọt, với bọt ga mịn màng và hậu vị kéo dài. Phù hợp để thưởng thức như một loại aperitif hoặc cùng với các món hải sản và phô mai.",
      "reviews": [
        {
          "id": 1,
          "name": "Nguyễn Thị Q",
          "rating": 5,
          "date": "10/07/2022",
          "content": "Champagne Premium này có hương vị phong phú và bọt ga mịn màng, rất phù hợp cho các dịp đặc biệt. Tôi đặc biệt thích hương thơm của hoa quả chín và bánh mì nướng."
        },
        {
          "id": 2,
          "name": "Trần Văn R",
          "rating": 4,
          "date": "25/07/2022",
          "content": "Sản phẩm chất lượng cao, hương vị phong phú và dễ uống. Đóng gói sang trọng và giao hàng nhanh chóng."
        }
      ]
    },
    {
      "id": "12",
      "name": "RƯỢU VANG ĐỎ PHÁP",
      "price": 680000,
      "oldPrice": 750000,
      "image": "/src/assets/products/12.jpg",
      "categoryId": "ruou-vang-do",
      "subcategoryId": "vang-phap",
      "description": "Rượu vang đỏ Pháp cao cấp với hương vị phức tạp của quả mọng đỏ, vani và chút hương gỗ sồi. Lý tưởng để kết hợp với các món thịt đỏ.",
      "featured": false,
      "bestSelling": false,
      "new": true,
      "sale": false,
      "tags": ["alcohol", "premium"],
      "features": "Rượu vang đỏ Pháp là loại rượu vang được sản xuất tại Pháp - một quốc gia có truyền thống lâu đời về sản xuất rượu vang. Đây là loại rượu có hương vị phức tạp và đậm đà.\n\nĐặc điểm nổi bật của rượu vang đỏ Pháp là hương thơm của quả mọng đỏ, vani, và chút hương gỗ sồi. Đây là loại rượu lý tưởng để kết hợp với các món thịt đỏ.",
      "information": "Rượu vang đỏ Pháp được sản xuất từ các giống nho đặc trưng của Pháp như Cabernet Sauvignon, Merlot, và Pinot Noir. Quá trình sản xuất tuân theo các quy định nghiêm ngặt của Pháp về rượu vang.\n\nSản phẩm này có nồng độ cồn cao, vị đậm đà với tannin mạnh và hậu vị kéo dài. Phù hợp để thưởng thức cùng các món thịt đỏ, phô mai lâu năm hoặc các món ăn có nước sốt đậm đà.",
      "reviews": [
        {
          "id": 1,
          "name": "Lê Thị S",
          "rating": 5,
          "date": "05/06/2022",
          "content": "Rượu vang đỏ Pháp này có hương vị phức tạp và đậm đà, rất phù hợp với các món thịt đỏ. Tôi đặc biệt thích hương thơm của quả mọng đỏ và vani."
        },
        {
          "id": 2,
          "name": "Phạm Văn T",
          "rating": 5,
          "date": "20/06/2022",
          "content": "Sản phẩm chất lượng cao, hương vị đậm đà và phức tạp. Đóng gói sang trọng và giao hàng nhanh chóng."
        }
      ]
    }
  ],
  "introduction": {
    "title": "GIỚI THIỆU",
    "content": "Vang nổ Thăng Long có hương vị đặc trưng của sản phẩm lên men tự nhiên từ hoa quả với độ rượu nhẹ, bọt ga đầy tràn mịn. Vang Nổ thăng long tạo cảm giác hương phấn, êm dịu, vui tươi, sản phẩm được đóng chai dung tích 750ml. Vang nổ Thăng Long có hương vị đặc trưng của sản phẩm lên men tự nhiên từ hoa quả với độ rượu nhẹ, bọt ga đầy tràn mịn. Vang Nổ thăng long tạo cảm giác hương phấn, êm dịu, vui tươi, sản phẩm được đóng chai dung tích 750ml. Vang nổ Thăng Long có hương vị đặc trưng của sản phẩm lên men tự nhiên từ hoa quả với độ rượu nhẹ, bọt ga đầy tràn mịn. Vang Nổ thăng long tạo cảm giác hương phấn, êm dịu, vui tươi, sản phẩm được đóng chai dung tích 750ml. Vang nổ Thăng Long có hương vị đặc trưng."
  },
  "galleryImages": [
    {
      "id": "1",
      "src": "https://cdn.pixabay.com/photo/2016/10/22/20/34/wines-1761613_1280.jpg",
      "alt": "Wine barrels in cellar",
      "link": ""
    },
    {
      "id": "2",
      "src": "https://cdn.pixabay.com/photo/2022/04/26/09/38/grapes-7157943_960_720.jpg",
      "alt": "Dark grapes on wooden surface",
      "link": "",
      "overlay": {
        "year": "1987",
        "title": "RƯỢU"
      }
    },
    {
      "id": "3",
      "src": "/src/assets/gallery/wine-tools.jpg",
      "alt": "Wine tools and grapes",
      "link": ""
    },
    {
      "id": "4",
      "src": "/src/assets/gallery/white-wine.jpg",
      "alt": "White wine glass with grapes",
      "link": ""
    },
    {
      "id": "5",
      "src": "/src/assets/gallery/wine-barrel.jpg",
      "alt": "Wine barrels in cellar",
      "link": ""
    },
    {
      "id": "6",
      "src": "https://cdn.pixabay.com/photo/2023/08/06/12/54/ai-generated-8172888_1280.jpg",
      "alt": "Dark grapes on wooden surface",
      "link": ""
    },
    {
      "id": "7",
      "src": "https://cdn.pixabay.com/photo/2017/01/04/13/55/grapes-1952035_1280.jpg",
      "alt": "Wine tools and grapes",
      "link": ""
    },
    {
      "id": "8",
      "src": "https://cdn.pixabay.com/photo/2017/01/04/14/03/grapes-1952073_1280.jpg",
      "alt": "White wine glass with grapes",
      "link": ""
    }
  ],
  "blogPosts": [
    {
      "id": "1",
      "title": "VANG THĂNG LONG CLASSIC: Khám Phá Hương Vị Truyền Thống",
      "date": "15/01/2023",
      "author": "Lê Minh Tuấn",
      "image": "https://cdn.pixabay.com/photo/2020/02/02/15/07/wine-4813260_640.jpg",
      "lastVideo": "https://pic.pikbest.com/19/88/61/59Y888piCVkx.mp4",
      "excerpt": "Tìm hiểu sâu hơn về Vang Nổ Thăng Long Classic, một biểu tượng của sự tinh tế và hương vị truyền thống Việt Nam. Khám phá câu chuyện đằng sau dòng vang nổ trứ danh này.",
      "content": "Vang Nổ Thăng Long Classic không chỉ là một thức uống, mà còn là một phần của di sản ẩm thực Việt. Được lên men tự nhiên từ những loại hoa quả chọn lọc, sản phẩm này mang trong mình hương vị đặc trưng, khó lẫn. Với độ rượu nhẹ nhàng, những bọt ga lăn tăn, mịn màng, Vang Nổ Thăng Long Classic đánh thức mọi giác quan, mang đến cảm giác sảng khoái, vui tươi. Chai dung tích 750ml cổ điển là lựa chọn hoàn hảo cho những buổi tiệc thân mật, những cuộc gặp gỡ bạn bè hay đơn giản là một chút thư giãn sau ngày dài. Quy trình sản xuất được kiểm soát nghiêm ngặt từ khâu lựa chọn nguyên liệu đến khi đóng chai, đảm bảo chất lượng đồng đều và hương vị tuyệt hảo đến tay người tiêu dùng. Đây là dòng sản phẩm đã khẳng định được vị thế của mình trên thị trường qua nhiều năm, được yêu mến bởi sự cân bằng hoàn hảo giữa hương thơm trái cây và vị chua ngọt dịu dàng."
    },
    {
      "id": "2",
      "title": "NGHỆ THUẬT THƯỞNG THỨC VANG NỔ THĂNG LONG CLASSIC",
      "date": "28/02/2023",
      "author": "Trần Thu Hoài",
      "image": "https://cdn.pixabay.com/photo/2018/12/28/01/34/rum-3898745_640.jpg",
      "lastVideo": "https://cdn.pixabay.com/video/2016/07/05/3708-173505143_medium.mp4",
      "excerpt": "Vang Nổ Thăng Long Classic sẽ ngon hơn khi được thưởng thức đúng cách. Bài viết này chia sẻ bí quyết từ việc chọn ly đến nhiệt độ phục vụ lý tưởng.",
      "content": "Thưởng thức Vang Nổ Thăng Long Classic là một trải nghiệm tinh tế. Để cảm nhận trọn vẹn hương vị của dòng vang này, việc đầu tiên cần chú ý là nhiệt độ. Vang nên được ướp lạnh ở nhiệt độ khoảng 6-8°C trước khi dùng. Sử dụng ly flute thon dài sẽ giúp giữ được bọt ga lâu hơn và tập trung hương thơm của vang. Khi rót, nghiêng nhẹ ly và rót từ từ vào thành ly để tránh làm mất đi lớp bọt ga quý giá. Hãy dành chút thời gian quan sát màu sắc vàng rơm óng ả, những dải bọt khí không ngừng chuyển động. Trước khi nếm, hãy đưa ly lên mũi để cảm nhận hương thơm phức hợp của các loại trái cây chín mọng quyện với một chút hương hoa cỏ nhẹ nhàng. Khi nhấp ngụm đầu tiên, hãy để vang lan tỏa khắp khoang miệng, cảm nhận vị chua thanh, ngọt dịu và hậu vị sảng khoái kéo dài. Thưởng thức chậm rãi là chìa khóa để khám phá hết sự quyến rũ của Vang Nổ Thăng Long Classic."
    },
    {
      "id": "3",
      "title": "VANG THĂNG LONG CLASSIC: ĐIỂM NHẤN CHO MỌI BUỔI TIỆC",
      "date": "10/04/2023",
      "author": "Phạm Hoàng Anh",
      "image": "https://cdn.pixabay.com/photo/2019/10/26/19/58/grape-4580207_1280.jpg",
      "lastVideo": "https://cdn.pixabay.com/video/2021/07/12/81170-575216182_large.mp4",
      "excerpt": "Từ những buổi sum họp gia đình ấm cúng đến các sự kiện trọng đại, Vang Nổ Thăng Long Classic luôn là sự lựa chọn tinh tế, mang lại không khí vui tươi và sang trọng.",
      "content": "Vang Nổ Thăng Long Classic là người bạn đồng hành không thể thiếu trong những khoảnh khắc đáng nhớ. Dù là một bữa tối lãng mạn, một buổi tiệc sinh nhật rộn rã, lễ kỷ niệm đáng nhớ hay đơn giản là cuộc gặp gỡ bạn bè cuối tuần, sự hiện diện của Vang Nổ Thăng Long Classic luôn làm tăng thêm phần ý nghĩa và hứng khởi. Với hương vị dễ chịu, phù hợp với khẩu vị của nhiều người, dòng vang này dễ dàng kết nối mọi người, tạo nên bầu không khí chan hòa, cởi mở. Tiếng nổ nhẹ khi mở chai và dòng bọt sủi tăm không chỉ mang tính biểu tượng cho sự ăn mừng mà còn khơi gợi niềm vui, sự lạc quan. Đặc biệt, trong các dịp lễ Tết truyền thống, Vang Nổ Thăng Long Classic càng trở nên quen thuộc, là món quà ý nghĩa để trao tặng hoặc cùng nhau nâng ly chúc mừng một năm mới an khang, thịnh vượng. Hãy để Vang Nổ Thăng Long Classic đồng hành cùng bạn trong mọi dấu ấn cuộc đời."
    },
    {
      "id": "4",
      "title": "GỢI Ý KẾT HỢP MÓN ĂN CÙNG VANG THĂNG LONG CLASSIC",
      "date": "25/05/2023",
      "author": "Nguyễn Thị Lan",
      "image": "https://cdn.pixabay.com/photo/2024/02/26/14/13/restaurant-8598064_640.jpg",
      "lastVideo": "https://cdn.pixabay.com/video/2018/03/02/14627-258543533_large.mp4",
      "excerpt": "Khám phá sự kết hợp ẩm thực tuyệt vời với Vang Nổ Thăng Long Classic. Từ món khai vị nhẹ nhàng đến các món chính đậm đà, tìm ra sự hài hòa hoàn hảo.",
      "content": "Vang Nổ Thăng Long Classic với hương vị cân bằng và độ chua sảng khoái là một lựa chọn đa năng để kết hợp với nhiều loại món ăn. Đối với các món khai vị, vang rất hợp với các loại gỏi cuốn, salad tươi mát, hoặc các món hải sản nhẹ nhàng như hàu sống, tôm hấp. Vị chua của vang sẽ làm nổi bật vị ngọt tự nhiên của hải sản. Với các món chính, Vang Nổ Thăng Long Classic có thể đi cùng các món gia cầm như gà luộc, gà nướng lá chanh, hoặc các món cá có vị thanh đạm. Ngay cả với một số món Á Đông có gia vị vừa phải, vang vẫn có thể tạo nên sự kết hợp thú vị. Ngoài ra, đây cũng là một lựa chọn tuyệt vời để thưởng thức cùng các loại phô mai mềm, trái cây tươi hoặc các món tráng miệng không quá ngọt. Sự linh hoạt trong việc phối hợp món ăn giúp Vang Nổ Thăng Long Classic trở thành một phần không thể thiếu trong các trải nghiệm ẩm thực đa dạng."
    },
    {
      "id": "5",
      "title": "VANG THĂNG LONG CLASSIC: QUY TRÌNH LÊN MEN ĐỘC ĐÁO",
      "date": "08/07/2023",
      "author": "Hoàng Văn Hải",
      "image": "https://cdn.pixabay.com/photo/2014/12/02/03/12/wineglass-553467_640.jpg",
      "lastVideo": "https://cdn.pixabay.com/video/2020/07/30/45977-447087673_large.mp4",
      "excerpt": "Đằng sau hương vị tuyệt hảo của Vang Nổ Thăng Long Classic là một quy trình lên men tự nhiên đầy tâm huyết, kế thừa những bí quyết truyền thống và ứng dụng công nghệ hiện đại.",
      "content": "Điều làm nên sự khác biệt của Vang Nổ Thăng Long Classic chính là quy trình sản xuất tỉ mỉ và đầy tâm huyết. Nguyên liệu chính là những loại hoa quả tươi ngon nhất, được thu hoạch đúng độ chín để đảm bảo lượng đường và axit tối ưu. Sau khi sơ chế, nước ép hoa quả được lên men tự nhiên theo phương pháp truyền thống, kết hợp với sự hỗ trợ của công nghệ hiện đại để kiểm soát chặt chẽ nhiệt độ và các yếu tố khác. Quá trình lên men này diễn ra từ từ, cho phép các loại nấm men đặc biệt phát triển, tạo ra cồn và CO2 tự nhiên – chính là những bọt ga mịn màng đặc trưng. Sau giai đoạn lên men chính, vang được ủ trong một thời gian nhất định để hương vị trở nên hài hòa, sâu lắng hơn. Mỗi công đoạn đều được các chuyên gia giàu kinh nghiệm theo dõi sát sao, từ việc chọn giống men, kiểm soát quá trình lên men đến lọc và đóng chai, tất cả nhằm mang đến một sản phẩm Vang Nổ Thăng Long Classic với chất lượng vượt trội và hương vị ổn định, chinh phục những người yêu vang khó tính nhất."
    },
    {
      "id": "6",
      "title": "BÍ QUYẾT BẢO QUẢN VÀ PHỤC VỤ VANG NỔ THĂNG LONG CLASSIC",
      "date": "19/08/2023",
      "author": "Đặng Bảo Châu",
      "image": "https://cdn.pixabay.com/photo/2016/10/22/20/34/wines-1761613_640.jpg",
      "lastVideo": "https://cdn.pixabay.com/video/2024/05/04/210602_large.mp4",
      "excerpt": "Để Vang Nổ Thăng Long Classic luôn giữ được hương vị tốt nhất, việc bảo quản và phục vụ đúng cách là vô cùng quan trọng. Cùng tìm hiểu những mẹo nhỏ hữu ích.",
      "content": "Chất lượng của Vang Nổ Thăng Long Classic có thể bị ảnh hưởng nếu không được bảo quản và phục vụ đúng cách. Đối với việc bảo quản, chai vang nên được giữ ở nơi thoáng mát, tối, tránh ánh nắng trực tiếp và nguồn nhiệt. Nhiệt độ lý tưởng để bảo quản là khoảng 10-15°C. Tránh rung động mạnh và thay đổi nhiệt độ đột ngột. Chai vang nổ thường được khuyên nên bảo quản ở tư thế đứng để giảm thiểu áp lực lên nút chai. Khi phục vụ, như đã đề cập, Vang Nổ Thăng Long Classic ngon nhất khi được ướp lạnh ở nhiệt độ 6-8°C. Có thể làm lạnh trong tủ lạnh khoảng 2-3 tiếng trước khi dùng hoặc ngâm trong xô đá có pha chút nước khoảng 20-30 phút. Khi mở chai, hãy cẩn thận, giữ chặt nút và xoay nhẹ thân chai thay vì xoay nút để tránh vang trào ra ngoài. Rót vang vào ly flute hoặc ly tulip để giữ bọt và hương thơm tốt hơn. Nếu không dùng hết, hãy đậy kín chai bằng nút chuyên dụng cho vang nổ và bảo quản trong tủ lạnh, sử dụng trong vòng 1-2 ngày."
    },
    {
      "id": "7",
      "title": "VANG THĂNG LONG: DI SẢN VÀ NIỀM TỰ HÀO CỦA THƯƠNG HIỆU VIỆT",
      "date": "05/10/2023",
      "author": "Vũ Đức Trung",
      "image": "https://cdn.pixabay.com/photo/2015/02/01/12/42/wine-619452_640.jpg",
      "lastVideo": "https://cdn.pixabay.com/video/2020/07/30/45978-447087658_large.mp4",
      "excerpt": "Vang Thăng Long không chỉ là một cái tên, đó là cả một hành trình xây dựng và phát triển, mang theo niềm tự hào về một thương hiệu vang Việt chất lượng, chinh phục người tiêu dùng qua nhiều thế hệ.",
      "content": "Thương hiệu Vang Thăng Long từ lâu đã trở thành một cái tên quen thuộc và được tin dùng bởi người Việt. Với lịch sử phát triển đáng tự hào, Vang Thăng Long đã không ngừng nỗ lực để mang đến những sản phẩm chất lượng cao, phù hợp với khẩu vị người Việt Nam mà vẫn giữ được những tiêu chuẩn quốc tế. Dòng sản phẩm Vang Nổ Thăng Long Classic là một minh chứng rõ nét cho sự thành công đó. Kế thừa những giá trị truyền thống trong sản xuất rượu vang từ hoa quả, kết hợp với việc đầu tư vào công nghệ hiện đại và quy trình kiểm soát chất lượng nghiêm ngặt, Vang Thăng Long đã tạo ra những chai vang nổ với hương vị đặc trưng, ổn định và được thị trường đón nhận nồng nhiệt. Niềm tự hào của thương hiệu không chỉ nằm ở chất lượng sản phẩm mà còn ở sự gắn bó với những khoảnh khắc vui tươi, những lễ hội và sự kiện quan trọng của người Việt. Vang Thăng Long tiếp tục khẳng định vị thế là một trong những thương hiệu vang hàng đầu của Việt Nam, mang hương vị Việt vươn xa."
    },
    {
      "id": "8",
      "title": "SO SÁNH VANG NỔ THĂNG LONG CLASSIC VÀ CÁC LOẠI VANG SỦI KHÁC",
      "date": "18/11/2023",
      "author": "Ngô Thanh Mai",
      "image": "https://cdn.pixabay.com/photo/2017/01/31/20/48/wine-2027177_640.jpg",
      "lastVideo": "https://cdn.pixabay.com/video/2024/05/04/210602_large.mp4",
      "excerpt": "Trên thị trường có nhiều loại vang sủi tăm. Vang Nổ Thăng Long Classic có những đặc điểm gì nổi bật để tạo nên dấu ấn riêng và chiếm được cảm tình của người thưởng thức?",
      "content": "Thế giới vang sủi rất đa dạng, từ Champagne của Pháp, Prosecco của Ý đến Cava của Tây Ban Nha. Vậy Vang Nổ Thăng Long Classic có gì đặc biệt? Điểm khác biệt lớn nhất và cũng là niềm tự hào của Vang Nổ Thăng Long Classic chính là việc nó được sản xuất từ các loại hoa quả nhiệt đới đặc trưng của Việt Nam, tạo nên một hương vị riêng biệt, gần gũi với khẩu vị người Việt. Trong khi nhiều loại vang sủi quốc tế chú trọng vào nho, Vang Nổ Thăng Long Classic mang đến một trải nghiệm mới mẻ với hương thơm phong phú của trái cây nhiệt đới. Về phương pháp sản xuất, mặc dù có những điểm tương đồng trong việc tạo ra bọt ga tự nhiên, quy trình của Vang Thăng Long được điều chỉnh để phù hợp với nguyên liệu và điều kiện tại Việt Nam. Độ cồn của Vang Nổ Thăng Long Classic thường nhẹ hơn so với một số dòng Champagne, làm cho nó trở thành một lựa chọn dễ uống, phù hợp cho nhiều dịp và không gây cảm giác nặng nề. Giá cả cũng là một yếu tố cạnh tranh, giúp Vang Nổ Thăng Long Classic tiếp cận được đông đảo người tiêu dùng hơn."
    },
    {
      "id": "9",
      "title": "CHIA SẺ TỪ KHÁCH HÀNG: KHOẢNH KHẮC ĐÁNG NHỚ CÙNG VANG THĂNG LONG CLASSIC",
      "date": "29/12/2023",
      "author": "Ban Biên Tập",
      "image": "https://cdn.pixabay.com/photo/2017/09/26/16/44/wine-2789265_640.jpg",
      "lastVideo": "https://pic.pikbest.com/19/88/61/59Y888piCVkx.mp4",
      "excerpt": "Lắng nghe những câu chuyện và chia sẻ chân thực từ những người đã chọn Vang Nổ Thăng Long Classic để đồng hành trong những khoảnh khắc đặc biệt của cuộc sống.",
      "content": "Không gì quý giá hơn những phản hồi tích cực và những câu chuyện đáng nhớ từ chính khách hàng đã trải nghiệm Vang Nổ Thăng Long Classic. Anh Minh Quân (Hà Nội) chia sẻ: 'Gia đình tôi luôn chọn Vang Nổ Thăng Long Classic cho những dịp Tết đến xuân về. Hương vị của nó như một phần không thể thiếu, gợi nhớ không khí đoàn viên ấm cúng.' Chị Thanh Trà (TP.HCM) lại có kỷ niệm vui: 'Buổi tiệc sinh nhật của tôi đã thêm phần trọn vẹn nhờ những chai Vang Nổ Thăng Long Classic. Bạn bè ai cũng khen vị vang dễ uống, sảng khoái.' Nhiều cặp đôi cũng chọn Vang Nổ Thăng Long Classic cho ngày trọng đại của mình, như lời kể của anh Tuấn và chị Lan: 'Chúng tôi đã cùng nhau nâng ly Vang Nổ Thăng Long Classic trong ngày cưới. Đó thực sự là một khoảnh khắc ngọt ngào và đáng nhớ.' Những chia sẻ này là động lực to lớn để Vang Thăng Long không ngừng cải tiến, mang đến những sản phẩm chất lượng hơn nữa, tiếp tục đồng hành và tạo nên nhiều khoảnh khắc ý nghĩa cùng quý khách hàng."
    }
  ],
  "testimonials": [
    {
      "id": "1",
      "name": "GIANG LT",
      "position": "Graphic design",
      "image": "/src/assets/designer.jpg",
      "content": "Vang nổ Thăng Long có hương vị đặc trưng của sản phẩm lên men tự nhiên từ hoa quả với độ rượu nhẹ, bọt ga đầy tràn mịn. Vang Nổ thăng long"
    },
    {
      "id": "2",
      "name": "MINH TRANG",
      "position": "Marketing Manager",
      "image": "/src/assets/designer.jpg",
      "content": "Sản phẩm rượu vang đỏ này có hương vị đậm đà, thơm ngon với hậu vị kéo dài. Tôi rất hài lòng khi thưởng thức cùng bạn bè trong các buổi tiệc."
    },
    {
      "id": "3",
      "name": "HOÀNG NAM",
      "position": "Wine Enthusiast",
      "image": "/src/assets/designer.jpg",
      "content": "Chất lượng rượu vang tuyệt vời với giá cả phải chăng. Đóng gói cẩn thận và giao hàng nhanh chóng. Tôi sẽ tiếp tục ủng hộ wine hourse."
    }
  ],
  "users": [
    {
      "id": "1",
      "firstName": "Admin",
      "lastName": "User",
      "email": "admin@example.com",
      "password": "password123",
      "createdAt": "2023-01-01T00:00:00.000Z",
      "updatedAt": "2023-01-01T00:00:00.000Z"
    },
    {
      "id": "2",
      "firstName": "Test",
      "lastName": "User",
      "email": "test@example.com",
      "password": "password123",
      "createdAt": "2023-01-02T00:00:00.000Z",
      "updatedAt": "2023-01-02T00:00:00.000Z"
    },
    {
      "id": "06f2",
      "firstName": "Đặng",
      "lastName": "Khanh",
      "email": "khanhdang@gmail.com",
      "password": "khanhdang123",
      "createdAt": "2025-05-19T03:15:20.265Z",
      "updatedAt": "2025-05-19T03:15:20.265Z"
    },
    {
      "id": "158c",
      "firstName": "Đặng",
      "lastName": "Khanh",
      "email": "khanhdang123@gmail.com",
      "password": "khanhdang123",
      "createdAt": "2025-05-19T03:16:28.700Z",
      "updatedAt": "2025-05-19T03:16:28.700Z"
    },
    {
      "id": "6bbe",
      "firstName": "Khanh",
      "lastName": "Khanh",
      "email": "khanhdang456@gmail.com",
      "password": "khanhdang123",
      "createdAt": "2025-05-19T04:42:31.786Z",
      "updatedAt": "2025-05-19T04:42:31.786Z"
    },
    {
      "id": "201f",
      "firstName": "Đặng",
      "lastName": "Khanh",
      "email": "khanhdang789@gmail.com",
      "password": "khanhdang123",
      "createdAt": "2025-05-19T04:44:03.153Z",
      "updatedAt": "2025-05-19T04:44:03.153Z"
    },
    {
      "id": "3acb",
      "firstName": "An",
      "lastName": "An",
      "email": "anan@gmail.com",
      "password": "khanhdang123",
      "createdAt": "2025-05-19T04:45:06.788Z",
      "updatedAt": "2025-05-19T04:45:06.788Z"
    },
    {
      "id": "5517",
      "firstName": "nana",
      "lastName": "nana",
      "email": "nana@gmail.com",
      "password": "khanhdang123",
      "createdAt": "2025-05-19T04:45:57.509Z",
      "updatedAt": "2025-05-19T04:45:57.509Z"
    },
    {
      "id": "8c08",
      "firstName": "nam",
      "lastName": "nam",
      "email": "namnam@gmail.com",
      "password": "khanhdang123",
      "createdAt": "2025-05-19T04:50:27.050Z",
      "updatedAt": "2025-05-19T04:50:27.050Z"
    },
    {
      "id": "3f4d",
      "firstName": "nhan",
      "lastName": "nhan",
      "email": "nhannhan@gmail.com",
      "password": "khanhdang123",
      "createdAt": "2025-05-19T04:52:15.310Z",
      "updatedAt": "2025-05-19T04:52:15.310Z"
    },
    {
      "id": "e432",
      "firstName": "ok",
      "lastName": "ok",
      "email": "okok@gmail.com",
      "password": "khanhdang123",
      "createdAt": "2025-05-19T04:56:10.055Z",
      "updatedAt": "2025-05-19T04:56:10.055Z"
    },
    {
      "id": "9957",
      "firstName": "Thái",
      "lastName": "Nguyễn",
      "email": "thainguyen@gmail.com",
      "password": "khanhdang123",
      "createdAt": "2025-05-19T05:00:39.705Z",
      "updatedAt": "2025-05-19T05:00:39.705Z"
    },
    {
      "id": "0041",
      "firstName": "Khanh",
      "lastName": "nam",
      "email": "khanhnam@gmail.com",
      "password": "khanhdang123",
      "createdAt": "2025-05-19T05:05:28.927Z",
      "updatedAt": "2025-05-19T05:05:28.927Z"
    },
    {
      "id": "4bce",
      "firstName": "thang",
      "lastName": "nguyen",
      "email": "nguyenthang@gmail.com",
      "password": "khanhdang123",
      "createdAt": "2025-05-19T05:11:58.479Z",
      "updatedAt": "2025-05-19T05:11:58.479Z"
    },
    {
      "id": "017a",
      "firstName": "Đặng",
      "lastName": "Xuân Khanh",
      "email": "khanhxuandang@gmail.com",
      "password": "khanhdang123",
      "createdAt": "2025-05-19T05:13:40.056Z",
      "updatedAt": "2025-05-19T05:13:40.056Z"
    },
    {
      "id": "540a",
      "firstName": "Đặng",
      "lastName": "Khanh",
      "email": "khanhdang3152@gmail.com",
      "password": "khanhdang123",
      "createdAt": "2025-05-26T06:35:04.887Z",
      "updatedAt": "2025-05-26T06:35:04.887Z"
    }
  ],
  "cart": [
    {
      "id": "1",
      "userId": "1",
      "items": [
        {
          "productId": "6",
          "quantity": 1
        },
        {
          "productId": "8",
          "quantity": 2
        },
        {
          "productId": "10",
          "quantity": 1
        }
      ]
    },
    {
      "id": "2",
      "userId": "2",
      "items": [
        {
          "productId": "5",
          "quantity": 1
        }
      ]
    },
    {
      "id": "3",
      "userId": "06f2",
      "items": []
    },
    {
      "id": "4",
      "userId": "158c",
      "items": [
        {
          "productId": "2",
          "quantity": 3
        },
        {
          "productId": "4",
          "quantity": 1
        }
      ]
    }
  ],
  "orders": [
    {
      "id": "1",
      "userId": "1",
      "orderNumber": "LEANHGIANG89",
      "orderDate": "17/06/2015",
      "createdDate": "14/03/2015",
      "warehouse": "HÀ ĐÔNG",
      "totalItems": 7,
      "totalAmount": 350000,
      "status": "completed",
      "items": [
        {
          "productId": "1",
          "quantity": 2,
          "price": 57000
        },
        {
          "productId": "3",
          "quantity": 1,
          "price": 109000
        },
        {
          "productId": "5",
          "quantity": 1,
          "price": 147000
        }
      ]
    },
    {
      "id": "2",
      "userId": "1",
      "orderNumber": "LEANHGIANG89",
      "orderDate": "17/06/2015",
      "createdDate": "14/03/2015",
      "warehouse": "HÀ ĐÔNG",
      "totalItems": 7,
      "totalAmount": 350000,
      "status": "completed",
      "items": [
        {
          "productId": "2",
          "quantity": 3,
          "price": 30000
        },
        {
          "productId": "4",
          "quantity": 1,
          "price": 19000
        }
      ]
    },
    {
      "id": "3",
      "userId": "1",
      "orderNumber": "LEANHGIANG89",
      "orderDate": "17/06/2015",
      "createdDate": "14/03/2015",
      "warehouse": "HÀ ĐÔNG",
      "totalItems": 7,
      "totalAmount": 350000,
      "status": "completed",
      "items": [
        {
          "productId": "6",
          "quantity": 1,
          "price": 320000
        }
      ]
    },
    {
      "id": "4",
      "userId": "1",
      "orderNumber": "LEANHGIANG89",
      "orderDate": "17/06/2015",
      "createdDate": "14/03/2015",
      "warehouse": "HÀ ĐÔNG",
      "totalItems": 7,
      "totalAmount": 350000,
      "status": "completed",
      "items": [
        {
          "productId": "7",
          "quantity": 1,
          "price": 320000
        }
      ]
    },
    {
      "id": "5",
      "userId": "1",
      "orderNumber": "LEANHGIANG89",
      "orderDate": "17/06/2015",
      "createdDate": "14/03/2015",
      "warehouse": "HÀ ĐÔNG",
      "totalItems": 7,
      "totalAmount": 350000,
      "status": "completed",
      "items": [
        {
          "productId": "8",
          "quantity": 1,
          "price": 320000
        }
      ]
    },
    {
      "id": "6",
      "userId": "1",
      "orderNumber": "LEANHGIANG89",
      "orderDate": "17/06/2015",
      "createdDate": "14/03/2015",
      "warehouse": "HÀ ĐÔNG",
      "totalItems": 7,
      "totalAmount": 350000,
      "status": "completed",
      "items": [
        {
          "productId": "9",
          "quantity": 1,
          "price": 320000
        }
      ]
    },
    {
      "id": "7",
      "userId": "1",
      "orderNumber": "LEANHGIANG89",
      "orderDate": "15/06/2015",
      "createdDate": "12/03/2015",
      "warehouse": "HÀ ĐÔNG",
      "totalItems": 3,
      "totalAmount": 250000,
      "status": "canceled",
      "items": [
        {
          "productId": "10",
          "quantity": 1,
          "price": 450000
        }
      ]
    },
    {
      "id": "8",
      "userId": "1",
      "orderNumber": "LEANHGIANG89",
      "orderDate": "14/06/2015",
      "createdDate": "11/03/2015",
      "warehouse": "HÀ ĐÔNG",
      "totalItems": 2,
      "totalAmount": 150000,
      "status": "canceled",
      "items": [
        {
          "productId": "11",
          "quantity": 1,
          "price": 520000
        }
      ]
    },
    {
      "id": "9",
      "userId": "1",
      "orderNumber": "LEANHGIANG89",
      "orderDate": "13/06/2015",
      "createdDate": "10/03/2015",
      "warehouse": "HÀ ĐÔNG",
      "totalItems": 1,
      "totalAmount": 680000,
      "status": "canceled",
      "items": [
        {
          "productId": "12",
          "quantity": 1,
          "price": 680000
        }
      ]
    },
    {
      "id": "10",
      "userId": "1",
      "orderNumber": "LEANHGIANG89",
      "orderDate": "12/06/2015",
      "createdDate": "09/03/2015",
      "warehouse": "HÀ ĐÔNG",
      "totalItems": 4,
      "totalAmount": 200000,
      "status": "canceled",
      "items": [
        {
          "productId": "1",
          "quantity": 1,
          "price": 57000
        },
        {
          "productId": "2",
          "quantity": 1,
          "price": 30000
        }
      ]
    },
    {
      "id": "11",
      "userId": "2",
      "orderNumber": "TESTUSER123",
      "orderDate": "10/06/2015",
      "createdDate": "07/03/2015",
      "warehouse": "HÀ NỘI",
      "totalItems": 2,
      "totalAmount": 166000,
      "status": "completed",
      "items": [
        {
          "productId": "1",
          "quantity": 1,
          "price": 57000
        },
        {
          "productId": "2",
          "quantity": 1,
          "price": 30000
        }
      ]
    },
    {
      "id": "12",
      "userId": "2",
      "orderNumber": "TESTUSER123",
      "orderDate": "09/06/2015",
      "createdDate": "06/03/2015",
      "warehouse": "HÀ NỘI",
      "totalItems": 3,
      "totalAmount": 429000,
      "status": "canceled",
      "items": [
        {
          "productId": "3",
          "quantity": 1,
          "price": 109000
        },
        {
          "productId": "5",
          "quantity": 1,
          "price": 147000
        }
      ]
    },
    {
      "id": "13",
      "userId": "06f2",
      "orderNumber": "KHANHDANG123",
      "orderDate": "08/06/2015",
      "createdDate": "05/03/2015",
      "warehouse": "HÀ NỘI",
      "totalItems": 5,
      "totalAmount": 640000,
      "status": "completed",
      "items": [
        {
          "productId": "6",
          "quantity": 2,
          "price": 320000
        }
      ]
    },
    {
      "id": "14",
      "userId": "06f2",
      "orderNumber": "KHANHDANG123",
      "orderDate": "07/06/2015",
      "createdDate": "04/03/2015",
      "warehouse": "HÀ NỘI",
      "totalItems": 3,
      "totalAmount": 320000,
      "status": "canceled",
      "items": [
        {
          "productId": "7",
          "quantity": 1,
          "price": 320000
        }
      ]
    },
    {
      "id": "15",
      "userId": "158c",
      "orderNumber": "KHANHDANG456",
      "orderDate": "06/06/2015",
      "createdDate": "03/03/2015",
      "warehouse": "HỒ CHÍ MINH",
      "totalItems": 2,
      "totalAmount": 320000,
      "status": "completed",
      "items": [
        {
          "productId": "8",
          "quantity": 1,
          "price": 320000
        }
      ]
    },
    {
      "id": "16",
      "userId": "158c",
      "orderNumber": "KHANHDANG456",
      "orderDate": "05/06/2015",
      "createdDate": "02/03/2015",
      "warehouse": "HỒ CHÍ MINH",
      "totalItems": 1,
      "totalAmount": 320000,
      "status": "canceled",
      "items": [
        {
          "productId": "9",
          "quantity": 1,
          "price": 320000
        }
      ]
    }
  ],
  "addresses": [
    {
      "id": "1",
      "userId": "1",
      "firstName": "Giang",
      "lastName": "Lê Anh",
      "company": "Cổ phần công nghệ DKT",
      "address": "Tòa nhà Hà Nội Group, 442 Đội Cấn, Ba Đình, Hà Nội",
      "city": "Hà Nội",
      "country": "Việt Nam",
      "postalCode": "2300089",
      "phone": "0974554928",
      "isDefault": true,
      "createdAt": "2023-01-01T00:00:00.000Z",
      "updatedAt": "2023-01-01T00:00:00.000Z"
    },
    {
      "id": "2",
      "userId": "1",
      "firstName": "Giang",
      "lastName": "Lê Anh",
      "company": "Cổ phần công nghệ DKT",
      "address": "Tòa nhà Hà Nội Group, 442 Đội Cấn, Ba Đình, Hà Nội",
      "city": "Hà Nội",
      "country": "Việt Nam",
      "postalCode": "2300089",
      "phone": "0974554928",
      "isDefault": false,
      "createdAt": "2023-01-02T00:00:00.000Z",
      "updatedAt": "2023-01-02T00:00:00.000Z"
    },
    {
      "id": "3",
      "userId": "2",
      "firstName": "Test",
      "lastName": "User",
      "company": "Test Company",
      "address": "123 Test Street, Test District, Test City",
      "city": "Hồ Chí Minh",
      "country": "Việt Nam",
      "postalCode": "7000000",
      "phone": "0987654321",
      "isDefault": true,
      "createdAt": "2023-01-03T00:00:00.000Z",
      "updatedAt": "2023-01-03T00:00:00.000Z"
    },
    {
      "id": "4",
      "userId": "06f2",
      "firstName": "Khanh",
      "lastName": "Đặng",
      "company": "Tech Company",
      "address": "456 Tech Street, Tech District",
      "city": "Hà Nội",
      "country": "Việt Nam",
      "postalCode": "1000000",
      "phone": "0912345678",
      "isDefault": false,
      "createdAt": "2023-01-04T00:00:00.000Z",
      "updatedAt": "2025-05-26T06:33:14.665Z"
    },
    {
      "id": "ccd9",
      "firstName": "Khanh",
      "lastName": "Khanh",
      "company": "test",
      "address": "test city",
      "city": "Đà Nẵng",
      "country": "Việt Nam",
      "postalCode": "5000",
      "phone": "",
      "isDefault": true,
      "userId": "5517",
      "createdAt": "2025-05-26T01:32:41.725Z",
      "updatedAt": "2025-05-26T01:32:41.725Z"
    },
    {
      "id": "54ae",
      "firstName": "Đặng",
      "lastName": "Xuân Khanh",
      "company": "Khanh Tech ",
      "address": "Hải Châu",
      "city": "Đà Nẵng",
      "country": "Việt Nam",
      "postalCode": "500012",
      "phone": "0987425309",
      "isDefault": false,
      "userId": "06f2",
      "createdAt": "2025-05-26T03:49:24.789Z",
      "updatedAt": "2025-05-26T06:33:40.689Z"
    },
    {
      "id": "8a6a",
      "firstName": "test",
      "lastName": "test",
      "company": "test",
      "address": "test",
      "city": "Hà Nội",
      "country": "Việt Nam",
      "postalCode": "tests",
      "phone": "tests",
      "isDefault": false,
      "userId": "06f2",
      "createdAt": "2025-05-26T04:37:27.361Z",
      "updatedAt": "2025-05-26T05:29:51.123Z"
    }
  ],
  "contacts": [
    {
      "id": "613b",
      "name": "dang kh",
      "email": "khanhdang@gmail.com",
      "subject": "no",
      "message": "đâs",
      "createdAt": "2025-05-29T04:15:49.110Z",
      "status": "new"
    }
  ]
}
